testing/dashboard/statistics.json
{
  "01 Home" : {
    "transaction" : "01 Home",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 106.79999999999998,
    "medianResTime" : 66.5,
    "minResTime" : 51.0,
    "maxResTime" : 720.0,
    "pct1ResTime" : 172.29999999999998,
    "pct2ResTime" : 182.89999999999998,
    "pct3ResTime" : 720.0,
    "throughput" : 4.284796115118189,
    "receivedKBytesPerSec" : 66.22722865189603,
    "sentKBytesPerSec" : 0.8870866957080625
  },
  "05 Advisories" : {
    "transaction" : "05 Advisories",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 72.95000000000003,
    "medianResTime" : 61.0,
    "minResTime" : 49.0,
    "maxResTime" : 285.0,
    "pct1ResTime" : 71.69999999999999,
    "pct2ResTime" : 276.3999999999993,
    "pct3ResTime" : 285.0,
    "throughput" : 4.715498270983967,
    "receivedKBytesPerSec" : 54.542519918068216,
    "sentKBytesPerSec" : 0.9992803953159384
  },
  "06 About" : {
    "transaction" : "06 About",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 78.98333333333335,
    "medianResTime" : 64.0,
    "minResTime" : 48.0,
    "maxResTime" : 305.0,
    "pct1ResTime" : 75.0,
    "pct2ResTime" : 304.9,
    "pct3ResTime" : 305.0,
    "throughput" : 4.799616030717543,
    "receivedKBytesPerSec" : 78.3092821324294,
    "sentKBytesPerSec" : 0.9936705063594913
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 360,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77.51944444444452,
    "medianResTime" : 61.0,
    "minResTime" : 46.0,
    "maxResTime" : 720.0,
    "pct1ResTime" : 111.60000000000048,
    "pct2ResTime" : 180.89999999999998,
    "pct3ResTime" : 305.0,
    "throughput" : 22.667170381564034,
    "receivedKBytesPerSec" : 303.64465275154265,
    "sentKBytesPerSec" : 4.75553102568946
  },
  "04 IoT Network" : {
    "transaction" : "04 IoT Network",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 70.59999999999997,
    "medianResTime" : 60.0,
    "minResTime" : 46.0,
    "maxResTime" : 277.0,
    "pct1ResTime" : 70.9,
    "pct2ResTime" : 265.04999999999916,
    "pct3ResTime" : 277.0,
    "throughput" : 4.636426860366278,
    "receivedKBytesPerSec" : 55.203891097094505,
    "sentKBytesPerSec" : 0.9825240514643381
  },
  "02 Heatwave Watch Dashboard" : {
    "transaction" : "02 Heatwave Watch Dashboard",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 67.06666666666665,
    "medianResTime" : 58.5,
    "minResTime" : 51.0,
    "maxResTime" : 302.0,
    "pct1ResTime" : 67.8,
    "pct2ResTime" : 79.54999999999995,
    "pct3ResTime" : 302.0,
    "throughput" : 4.4920266526914725,
    "receivedKBytesPerSec" : 53.08524146982856,
    "sentKBytesPerSec" : 0.9475368720521076
  },
  "03 AI Forecasting" : {
    "transaction" : "03 AI Forecasting",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 68.71666666666667,
    "medianResTime" : 61.5,
    "minResTime" : 49.0,
    "maxResTime" : 275.0,
    "pct1ResTime" : 68.9,
    "pct2ResTime" : 136.5499999999997,
    "pct3ResTime" : 275.0,
    "throughput" : 4.561350159647256,
    "receivedKBytesPerSec" : 60.71978164911814,
    "sentKBytesPerSec" : 0.9577053557853125
  }
}